Laminar Pipe/laminarPipe3/0/thickness
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thickness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            fixedValue;
        value           nonuniform 0();
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    lowerWall
    {
        type            fixedValue;
        value           nonuniform 0();
    }
    upperWall
    {
        type            fixedValue;
        value           nonuniform 0();
    }
    suplat
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
82800
(
0.01159999
0.0116
0.0116
0.0116
0.0116
0.0116
0.0116
0.0116
...
)
;
    }
}


// ************************************************************************* //
