Laminar Pipe/laminarPipe3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          3087;
        startFace       2370582;
    }
    outlet
    {
        type            patch;
        nFaces          3087;
        startFace       2373669;
    }
    suplat
    {
        type            wall;
        inGroups        1(wall);
        nFaces          82800;
        startFace       2376756;
    }
)

// ************************************************************************* //
